# **Итоговая проверочная работа**
## **Задача**
> ***Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше, либо равна 3 символа. При решении не рекомендуется использовать коллекции, лучше обойтись массивами.***
## **Решение**
> 1. Объявляем изначально заданный массив (inputArray) из строк. Объявляем размер(count) результирующего массива и индекс(index) первого элемента результирующего массива.
> 2. С помощью цикла for проверяем все элементы изначального массива (inputArray) и находим количество элементов (count), удовлетовряющих условию задачи. Это значение и будет длиной результурющего массива (finalArray).
> 3. Выводим изначальный массив (inputArray) в консоль для пользователя, при помощи методов Console.WriteLine и String.Join.
> 4. Объявляем результрующий массив (finalArray).
> 5. С помощью цикла for заполняем результирующий массив (finalArray) элементами, удовлетворяющими условию задачи.
> 6. Выводим результирующий массив (finalArray) в консоль для пользователя, при помощи методов Console.WriteLine и String.Join.
